[
  {
    "id": 1311031,
    "title": "Demon Slayer: Kimetsu no Yaiba Infinity Castle",
    "genres": [
      "Animation",
      "Action",
      "Fantasy",
      "Thriller"
    ],
    "overview": "The Demon Slayer Corps are drawn into the Infinity Castle, where Tanjiro, Nezuko, and the Hashira face terrifying Upper Rank demons in a desperate fight as the final battle against Muzan Kibutsuji begins.",
    "release_date": "2025-07-18",
    "vote_average": 7.648,
    "vote_count": 273
  },
  {
    "id": 755898,
    "title": "War of the Worlds",
    "genres": [
      "Science Fiction",
      "Thriller"
    ],
    "overview": "Will Radford is a top analyst for Homeland Security who tracks potential threats through a mass surveillance program, until one day an attack by an unknown entity leads him to question whether the government is hiding something from him... and from the rest of the world.",
    "release_date": "2025-07-29",
    "vote_average": 4.338,
    "vote_count": 543
  },
  {
    "id": 1078605,
    "title": "Weapons",
    "genres": [
      "Horror",
      "Mystery"
    ],
    "overview": "When all but one child from the same class mysteriously vanish on the same night at exactly the same time, a community is left questioning who or what is behind their disappearance.",
    "release_date": "2025-08-04",
    "vote_average": 7.389,
    "vote_count": 1405
  },
  {
    "id": 1038392,
    "title": "The Conjuring: Last Rites",
    "genres": [
      "Horror"
    ],
    "overview": "Paranormal investigators Ed and Lorraine Warren take on one last terrifying case involving mysterious entities they must confront.",
    "release_date": "2025-09-03",
    "vote_average": 6.618,
    "vote_count": 359
  },
  {
    "id": 1007734,
    "title": "Nobody 2",
    "genres": [
      "Action",
      "Thriller"
    ],
    "overview": "Former assassin Hutch Mansell takes his family on a nostalgic vacation to a small-town theme park, only to be pulled back into violence when they clash with a corrupt operator, a crooked sheriff, and a ruthless crime boss.",
    "release_date": "2025-08-13",
    "vote_average": 7.284,
    "vote_count": 560
  },
  {
    "id": 1061474,
    "title": "Superman",
    "genres": [
      "Science Fiction",
      "Adventure",
      "Action"
    ],
    "overview": "Superman, a journalist in Metropolis, embarks on a journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent.",
    "release_date": "2025-07-09",
    "vote_average": 7.508,
    "vote_count": 3165
  },
  {
    "id": 506763,
    "title": "Detective Dee: The Four Heavenly Kings",
    "genres": [
      "Action",
      "Fantasy",
      "Adventure",
      "Mystery"
    ],
    "overview": "Dee, the detective serving Chinese empress Wu Zetian, is called upon to investigate a series of strange events in Loyang, including the appearance of mysterious warriors wearing Chiyou ghost masks, foxes that speak human language and the pillar sculptures in the palace coming alive.",
    "release_date": "2018-07-27",
    "vote_average": 6.226,
    "vote_count": 199
  },
  {
    "id": 1035259,
    "title": "The Naked Gun",
    "genres": [
      "Comedy",
      "Action",
      "Crime"
    ],
    "overview": "Only one man has the particular set of skills... to lead Police Squad and save the world: Lt. Frank Drebin Jr.",
    "release_date": "2025-07-30",
    "vote_average": 6.69,
    "vote_count": 683
  },
  {
    "id": 1028248,
    "title": "As Good as Dead",
    "genres": [
      "Action",
      "Crime"
    ],
    "overview": "An ex-cop in self-imposed witness protection in Mexico becomes a target when a fight video of his apprentice goes viral.",
    "release_date": "2022-12-16",
    "vote_average": 6.362,
    "vote_count": 65
  },
  {
    "id": 1369679,
    "title": "Get Fast",
    "genres": [
      "Action",
      "Crime",
      "Thriller"
    ],
    "overview": "When The Thief’s partner is kidnapped after stealing millions in cash from a merciless drug lord named Nushi, he reluctantly teams up with an angst-ridden orphan to rescue him. Nushi enlists her most trusted hitman, The Cowboy, a lovable charmer who’s quick with his guns, to track down the Thief. Guns, cars, and explosions will give the newfound partners a head start, but how long will they be able to keep it up?",
    "release_date": "2024-12-12",
    "vote_average": 6.19,
    "vote_count": 21
  },
  {
    "id": 911430,
    "title": "F1",
    "genres": [
      "Action",
      "Drama"
    ],
    "overview": "Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.",
    "release_date": "2025-06-25",
    "vote_average": 7.83,
    "vote_count": 2098
  },
  {
    "id": 914215,
    "title": "Humane",
    "genres": [
      "Horror",
      "Science Fiction",
      "Thriller"
    ],
    "overview": "In the wake of an environmental collapse that has forced humanity to shed 20% of its population, a family dinner erupts into chaos when a father's plan to enlist in the government's new euthanasia program goes horribly awry.",
    "release_date": "2024-04-26",
    "vote_average": 5.398,
    "vote_count": 161
  },
  {
    "id": 1234821,
    "title": "Jurassic World Rebirth",
    "genres": [
      "Science Fiction",
      "Adventure",
      "Action"
    ],
    "overview": "Five years after the events of Jurassic World Dominion, covert operations expert Zora Bennett is contracted to lead a skilled team on a top-secret mission to secure genetic material from the world's three most massive dinosaurs. When Zora's operation intersects with a civilian family whose boating expedition was capsized, they all find themselves stranded on an island where they come face-to-face with a sinister, shocking discovery that's been hidden from the world for decades.",
    "release_date": "2025-07-01",
    "vote_average": 6.397,
    "vote_count": 2112
  },
  {
    "id": 1051486,
    "title": "Stockholm Bloodbath",
    "genres": [
      "Action",
      "History",
      "Drama",
      "Adventure",
      "War"
    ],
    "overview": "In 1520, the notorious and power-hungry Danish King Christian II is determined to seize the Swedish crown from Sten Sture, no matter what it takes. Meanwhile, sisters Freja and Anne make a solemn promise to seek revenge on the men who brutally murdered their family. Everything comes to a head in the heart of Stockholm, where the sisters are drawn into a ruthless political struggle between Sweden and Denmark that culminates in a mass execution, presided over by the mad King \"Christian the Tyrant,\" known as the Stockholm Bloodbath.",
    "release_date": "2024-01-19",
    "vote_average": 6.2,
    "vote_count": 32
  },
  {
    "id": 575265,
    "title": "Mission: Impossible - The Final Reckoning",
    "genres": [
      "Action",
      "Adventure",
      "Thriller"
    ],
    "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
    "release_date": "2025-05-17",
    "vote_average": 7.285,
    "vote_count": 1729
  },
  {
    "id": 691363,
    "title": "The Thing Behind The Door",
    "genres": [
      "Horror"
    ],
    "overview": "The story of Adèle, a youg woman who’s literally haunted by the death of her husband, killed in a trench during World War One. Desperate and unable to face this tragic loss, Adèle turns to black magic in the hope to bring her lover back. The miracle will happen, but Adèle will have to pay the price for opening this Pandora Box.",
    "release_date": "2023-01-16",
    "vote_average": 5.524,
    "vote_count": 21
  },
  {
    "id": 803796,
    "title": "KPop Demon Hunters",
    "genres": [
      "Animation",
      "Comedy",
      "Fantasy",
      "Music"
    ],
    "overview": "When K-pop superstars Rumi, Mira and Zoey aren't selling out stadiums, they're using their secret powers to protect their fans from supernatural threats.",
    "release_date": "2025-06-20",
    "vote_average": 8.318,
    "vote_count": 1425
  },
  {
    "id": 1087192,
    "title": "How to Train Your Dragon",
    "genres": [
      "Fantasy",
      "Family",
      "Action",
      "Adventure"
    ],
    "overview": "On the rugged isle of Berk, where Vikings and dragons have been bitter enemies for generations, Hiccup stands apart, defying centuries of tradition when he befriends Toothless, a feared Night Fury dragon. Their unlikely bond reveals the true nature of dragons, challenging the very foundations of Viking society.",
    "release_date": "2025-06-06",
    "vote_average": 8.033,
    "vote_count": 1914
  },
  {
    "id": 1242011,
    "title": "Together",
    "genres": [
      "Horror"
    ],
    "overview": "With a move to the countryside already testing the limits of a couple's relationship, a supernatural encounter begins an extreme transformation of their love, their lives, and their flesh.",
    "release_date": "2025-07-28",
    "vote_average": 7.114,
    "vote_count": 431
  },
  {
    "id": 1119878,
    "title": "Ice Road: Vengeance",
    "genres": [
      "Action",
      "Thriller",
      "Drama"
    ],
    "overview": "Big rig ice road driver Mike McCann travels to Nepal to scatter his late brother’s ashes on Mt. Everest. While on a packed tour bus traversing the deadly 12,000 ft. terrain of the infamous Road to the Sky, McCann and his mountain guide encounter a group of mercenaries and must fight to save themselves, the busload of innocent travelers, and the local villagers’ homeland.",
    "release_date": "2025-06-27",
    "vote_average": 6.483,
    "vote_count": 378
  },
  {
    "id": 7451,
    "title": "xXx",
    "genres": [
      "Action",
      "Adventure",
      "Thriller",
      "Crime"
    ],
    "overview": "Xander Cage is your standard adrenaline junkie with no fear and a lousy attitude. When the US Government \"recruits\" him to go on a mission, he's not exactly thrilled. His mission: to gather information on an organization that may just be planning the destruction of the world, led by the nihilistic Yorgi.",
    "release_date": "2002-08-09",
    "vote_average": 5.961,
    "vote_count": 4546
  },
  {
    "id": 1175942,
    "title": "The Bad Guys 2",
    "genres": [
      "Animation",
      "Family",
      "Comedy",
      "Crime",
      "Adventure"
    ],
    "overview": "The now-reformed Bad Guys are trying (very, very hard) to be good, but instead find themselves hijacked into a high-stakes, globe-trotting heist, masterminded by a new team of criminals they never saw coming: The Bad Girls.",
    "release_date": "2025-07-24",
    "vote_average": 7.8,
    "vote_count": 374
  },
  {
    "id": 1321439,
    "title": "The Wrong Paris",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "overview": "Dawn thinks she's joining a dating show in Paris, France, only to land in Paris, Texas. She has an exit plan — until sparks fly with the cowboy bachelor.",
    "release_date": "2025-09-11",
    "vote_average": 6.702,
    "vote_count": 94
  },
  {
    "id": 617126,
    "title": "The Fantastic 4: First Steps",
    "genres": [
      "Science Fiction",
      "Adventure"
    ],
    "overview": "Against the vibrant backdrop of a 1960s-inspired, retro-futuristic world, Marvel's First Family is forced to balance their roles as heroes with the strength of their family bond, while defending Earth from a ravenous space god called Galactus and his enigmatic Herald, Silver Surfer.",
    "release_date": "2025-07-23",
    "vote_average": 7.181,
    "vote_count": 1230
  },
  {
    "id": 1151334,
    "title": "Eenie Meanie",
    "genres": [
      "Thriller",
      "Action",
      "Comedy"
    ],
    "overview": "A former teenage getaway driver gets dragged back into her unsavory past when a former employer offers her a chance to save the life of her chronically unreliable ex-boyfriend.",
    "release_date": "2025-08-21",
    "vote_average": 6.385,
    "vote_count": 191
  },
  {
    "id": 13494,
    "title": "Red Sonja",
    "genres": [
      "Adventure",
      "Action",
      "Fantasy"
    ],
    "overview": "A young girl rises from the ashes of tragedy to become the most feared warrior woman of all time: the She-Devil with a Sword.",
    "release_date": "2025-07-31",
    "vote_average": 5.7,
    "vote_count": 90
  },
  {
    "id": 1188808,
    "title": "Tuhog",
    "genres": [
      "Drama",
      "Romance"
    ],
    "overview": "Abie mourns after the death of Michael. She finds solace from her supposedly soon-to-be father-in-law, Roldan, and starts falling for him. But when Michael returns, their world turns upside down.",
    "release_date": "2023-11-03",
    "vote_average": 5.583,
    "vote_count": 12
  },
  {
    "id": 1382406,
    "title": "Striking Rescue",
    "genres": [
      "Action",
      "Crime",
      "Thriller"
    ],
    "overview": "A veteran Muay Thai expert goes on a take-no-prisoners mission of revenge after his wife and daughter are brutally murdered by mysterious forces.",
    "release_date": "2024-12-05",
    "vote_average": 7.6,
    "vote_count": 116
  },
  {
    "id": 552524,
    "title": "Lilo & Stitch",
    "genres": [
      "Family",
      "Science Fiction",
      "Comedy",
      "Adventure"
    ],
    "overview": "The wildly funny and touching story of a lonely Hawaiian girl and the fugitive alien who helps to mend her broken family.",
    "release_date": "2025-05-17",
    "vote_average": 7.3,
    "vote_count": 1606
  },
  {
    "id": 604079,
    "title": "The Long Walk",
    "genres": [
      "Horror",
      "Thriller",
      "Science Fiction"
    ],
    "overview": "In a dystopian, alternate-America ruled by a totalitarian regime, 50 teenage boys take part in a deadly annual walking contest, forced to maintain a minimum pace or be executed, until only one survivor remains.",
    "release_date": "2025-09-10",
    "vote_average": 7.2,
    "vote_count": 94
  },
  {
    "id": 541671,
    "title": "Ballerina",
    "genres": [
      "Action",
      "Thriller",
      "Crime"
    ],
    "overview": "Taking place during the events of John Wick: Chapter 3 – Parabellum, Eve Macarro begins her training in the assassin traditions of the Ruska Roma.",
    "release_date": "2025-06-04",
    "vote_average": 7.373,
    "vote_count": 1650
  },
  {
    "id": 1506456,
    "title": "Maalikaya",
    "genres": [
      "Drama",
      "Romance"
    ],
    "overview": "Kara, a young inmate who unleashes her hidden sexual fantasies while serving time. After meeting Lila, a seductive inmate played by Jenn Rosa, Kara finds a new purpose in life. But her dark past still haunts her even behind bars.",
    "release_date": "2025-07-25",
    "vote_average": 7.8,
    "vote_count": 5
  },
  {
    "id": 138843,
    "title": "The Conjuring",
    "genres": [
      "Horror",
      "Thriller"
    ],
    "overview": "Paranormal investigators Ed and Lorraine Warren work to help a family terrorized by a dark presence in their farmhouse. Forced to confront a powerful entity, the Warrens find themselves caught in the most terrifying case of their lives.",
    "release_date": "2013-07-18",
    "vote_average": 7.541,
    "vote_count": 12169
  },
  {
    "id": 980477,
    "title": "Ne Zha 2",
    "genres": [
      "Animation",
      "Fantasy",
      "Adventure",
      "Action"
    ],
    "overview": "After a catastrophic event leaves their bodies destroyed, Ne Zha and Ao Bing are granted a fragile second chance at life. As tensions rise between the dragon clans and celestial forces, the two must undergo a series of perilous trials that will test their bond, challenge their identities, and decide the fate of both mortals and immortals.",
    "release_date": "2025-01-29",
    "vote_average": 8.0,
    "vote_count": 360
  },
  {
    "id": 1242434,
    "title": "Highest 2 Lowest",
    "genres": [
      "Thriller",
      "Crime",
      "Drama"
    ],
    "overview": "When a titan music mogul, widely known as having the \"best ears in the business\", is targeted with a ransom plot, he is jammed up in a life-or-death moral dilemma.",
    "release_date": "2025-08-14",
    "vote_average": 5.816,
    "vote_count": 228
  },
  {
    "id": 1022787,
    "title": "Elio",
    "genres": [
      "Animation",
      "Family",
      "Comedy",
      "Adventure",
      "Science Fiction"
    ],
    "overview": "Elio, a space fanatic with an active imagination, finds himself on a cosmic misadventure where he must form new bonds with eccentric alien lifeforms, navigate a crisis of intergalactic proportions and somehow discover who he is truly meant to be.",
    "release_date": "2025-06-18",
    "vote_average": 6.92,
    "vote_count": 446
  },
  {
    "id": 1530127,
    "title": "Lookout",
    "genres": [
      "Thriller",
      "Science Fiction",
      "Horror"
    ],
    "overview": "Seeking peace away from her turbulent life, a young woman accepts a job as a fire lookout at a remote wilderness tower. As she settles into her new role, eerie disturbances and strange occurrences begin to unfold, and she must uncover the chilling secrets that disrupt her isolation before it’s too late.",
    "release_date": "2025-09-02",
    "vote_average": 6.4,
    "vote_count": 5
  },
  {
    "id": 1252428,
    "title": "Anaconda",
    "genres": [
      "Adventure",
      "Horror",
      "Thriller"
    ],
    "overview": "A struggling circus crew gets deceived by its former partner, as it embarks on a tour in Thailand. During the journey through a Southeast Asian rainforest, they encounter attacks by a giant python. They meet a mysterious man named Jeff who offers to help, but they soon realize he's a poacher. As they search for Jeff's boat, they face life-and-death struggles with the python and Jeff himself.",
    "release_date": "2024-03-01",
    "vote_average": 7.2,
    "vote_count": 97
  },
  {
    "id": 1125257,
    "title": "Freakier Friday",
    "genres": [
      "Comedy",
      "Fantasy",
      "Family"
    ],
    "overview": "Years after Tess and Anna endured an identity crisis, Anna now has a daughter of her own and a soon-to-be stepdaughter. As they navigate the myriad challenges that come when two families merge, Tess and Anna discover lightning might indeed strike twice.",
    "release_date": "2025-08-06",
    "vote_average": 6.849,
    "vote_count": 175
  },
  {
    "id": 660033,
    "title": "How I Became a Gangster",
    "genres": [
      "Crime",
      "Action"
    ],
    "overview": "The action of the film begins in the 1970s – even then, the young protagonist knows that adrenaline tastes better than powdered milk. Over time, he also discovers a desire for money, power, and being above the law. A transformation begins, and his gangster talent blossoms. Together with a friend, they build their own army.",
    "release_date": "2019-12-25",
    "vote_average": 7.0,
    "vote_count": 112
  },
  {
    "id": 993234,
    "title": "Borders of Love",
    "genres": [
      "Drama",
      "Romance"
    ],
    "overview": "After years together, Petr and Hana, partners in work and in life, share their unspoken erotic fantasies. What begins as an innocent conversation gradually turns into curious experimentation with a non-monogamous approach to their relationship. But sexual freedom tastes differently for each of them.",
    "release_date": "2022-11-03",
    "vote_average": 6.1,
    "vote_count": 27
  },
  {
    "id": 1367575,
    "title": "A Line of Fire",
    "genres": [
      "Action",
      "Thriller"
    ],
    "overview": "After working as a secret agent in the FBI for ten years, Jack 'Cash' Conry left it all behind after his wife passed in order to dedicate himself to his two daughters. Despite a fulfilling life at home, Cash misses the chance to make an impact and has been considering a return to the force. The decision is made for him when his old partner’s niece Jamie calls him for help, launching Cash right back into a world of danger, corruption and intrigue.",
    "release_date": "2025-04-05",
    "vote_average": 6.333,
    "vote_count": 36
  },
  {
    "id": 1284120,
    "title": "The Ugly Stepsister",
    "genres": [
      "Horror",
      "Comedy",
      "Fantasy",
      "Drama"
    ],
    "overview": "In a fairy-tale kingdom where beauty is a brutal business, Elvira battles to compete with her incredibly beautiful stepsister, and she will go to any length to catch the prince’s eye.",
    "release_date": "2025-03-07",
    "vote_average": 7.213,
    "vote_count": 382
  },
  {
    "id": 715287,
    "title": "Stepmom's Desire",
    "genres": [
      "Drama",
      "Romance"
    ],
    "overview": "Sang-jin, who was envious of her neighbor after getting a beautiful wife, Ask your wife's friend Gian to take over the son's extracurricular teacher, Sang-jin, who left work early, accidentally sees Gian's shower. A man who wants to have sex with his son's tutor, And a son who wants to have a good time with a young stepmom, Ji-an and Jin-hee, who want money, are disappointed with her husband, and Bin-jin gives her body to a young son.",
    "release_date": "2020-05-29",
    "vote_average": 7.2,
    "vote_count": 30
  },
  {
    "id": 994682,
    "title": "Sexy Oral: Uwakina Kuchibiru",
    "genres": [
      "Drama"
    ],
    "overview": "A woman rejects her clingy female lover and pursues a female co-worker. The spurned lover plots revenge and the co-worker has a kinky secret.",
    "release_date": "1984-02-17",
    "vote_average": 6.0,
    "vote_count": 2
  },
  {
    "id": 1470086,
    "title": "Ligaw",
    "genres": [
      "Drama",
      "Romance"
    ],
    "overview": "A sultry woman who charms the hearts of men in a remote province. Dolores, a devoted wife to her paraplegic husband, falls for a young mountaineer. What begins as a reckless escape turns into an affair drenched in passion and secrecy.",
    "release_date": "2025-05-09",
    "vote_average": 7.2,
    "vote_count": 4
  },
  {
    "id": 1083433,
    "title": "I Know What You Did Last Summer",
    "genres": [
      "Horror",
      "Mystery",
      "Thriller"
    ],
    "overview": "When five friends inadvertently cause a deadly car accident, they cover up their involvement and make a pact to keep it a secret rather than face the consequences. A year later, their past comes back to haunt them and they're forced to confront a horrifying truth: someone knows what they did last summer…and is hell-bent on revenge.",
    "release_date": "2025-07-16",
    "vote_average": 5.953,
    "vote_count": 369
  },
  {
    "id": 574475,
    "title": "Final Destination Bloodlines",
    "genres": [
      "Horror",
      "Mystery"
    ],
    "overview": "Plagued by a violent recurring nightmare, college student Stefanie heads home to track down the one person who might be able to break the cycle and save her family from the grisly demise that inevitably awaits them all.",
    "release_date": "2025-05-14",
    "vote_average": 7.125,
    "vote_count": 2153
  },
  {
    "id": 1354441,
    "title": "The Hacienda: Return of the Damned",
    "genres": [
      "Horror"
    ],
    "overview": "A group of friends return to their hometown after many years. The trip is an excuse to reminisce about old times but turns into a nightmare when they unearth their darkest memories.",
    "release_date": "2025-03-09",
    "vote_average": 5.5,
    "vote_count": 2
  },
  {
    "id": 157336,
    "title": "Interstellar",
    "genres": [
      "Adventure",
      "Drama",
      "Science Fiction"
    ],
    "overview": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
    "release_date": "2014-11-05",
    "vote_average": 8.461,
    "vote_count": 37857
  },
  {
    "id": 70196,
    "title": "The Veteran",
    "genres": [
      "Action",
      "Crime",
      "Thriller"
    ],
    "overview": "Soldier Robert Miller returns home from Afghanistan unable to fit back into society. Living on a violent council estate and finding work in undercover surveillance, he becomes obsessed with taking down a group of local gangsters who are intrinsically tied to a suspected terrorist cell. Taking the situation into his own hands, Robert embarks on a brutal quest for justice, with devastating consequences.",
    "release_date": "2011-04-29",
    "vote_average": 5.8,
    "vote_count": 128
  },
  {
    "id": 423108,
    "title": "The Conjuring: The Devil Made Me Do It",
    "genres": [
      "Horror",
      "Mystery",
      "Thriller"
    ],
    "overview": "Paranormal investigators Ed and Lorraine Warren encounter what would become one of the most sensational cases from their files. The fight for the soul of a young boy takes them beyond anything they'd ever seen before, to mark the first time in U.S. history that a murder suspect would claim demonic possession as a defense.",
    "release_date": "2021-05-25",
    "vote_average": 7.394,
    "vote_count": 6221
  },
  {
    "id": 1151031,
    "title": "Bring Her Back",
    "genres": [
      "Horror"
    ],
    "overview": "Following the death of their father, a brother and sister are introduced to their new sibling by their foster mother, only to learn that she has a terrifying secret.",
    "release_date": "2025-05-28",
    "vote_average": 7.421,
    "vote_count": 889
  },
  {
    "id": 1071585,
    "title": "M3GAN 2.0",
    "genres": [
      "Action",
      "Science Fiction",
      "Thriller"
    ],
    "overview": "After the underlying tech for M3GAN is stolen and misused by a powerful defense contractor to create a military-grade weapon known as Amelia, M3GAN's creator Gemma realizes that the only option is to resurrect M3GAN and give her a few upgrades, making her faster, stronger, and more lethal.",
    "release_date": "2025-06-25",
    "vote_average": 7.498,
    "vote_count": 827
  },
  {
    "id": 1088166,
    "title": "Relay",
    "genres": [
      "Thriller",
      "Drama"
    ],
    "overview": "Tom, a world class \"fixer\", specializes in brokering lucrative payoffs between corrupt corporations and the individuals who threaten their ruin. He keeps his identity a secret through meticulous planning and always follows an exacting set of rules. But when a message arrives one day from potential client Sarah, needing Tom's protection just to stay alive, the rules quickly start to change.",
    "release_date": "2025-08-21",
    "vote_average": 7.158,
    "vote_count": 38
  },
  {
    "id": 1403735,
    "title": "Laila",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "overview": "Sonu Model, a renowned beautician from the old city, is forced to disguise himself as Laila, leading to a series of comedic, romantic, and action-packed events. Chaos ensues in this hilarious laugh riot",
    "release_date": "2025-02-14",
    "vote_average": 5.8,
    "vote_count": 5
  },
  {
    "id": 974397,
    "title": "My Freaky Family",
    "genres": [
      "Animation",
      "Family",
      "Fantasy"
    ],
    "overview": "On the cusp of her 13th birthday, Betty Flood – budding musician and magical being – just wants to be like the rest of her fabulous, but very different family, so why is her magical Mum so against it? As Betty wrestles with this, she also learns the amazing truth about her family and discovers that the not so normal, the magical and the musical are all a part of her fabulously freaky family. It's very freaky, so be freaked freaky ahh deaky peaky neaky seaky peaky poo.",
    "release_date": "2024-04-25",
    "vote_average": 7.0,
    "vote_count": 6
  },
  {
    "id": 986056,
    "title": "Thunderbolts*",
    "genres": [
      "Action",
      "Science Fiction",
      "Adventure"
    ],
    "overview": "After finding themselves ensnared in a death trap, seven disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts.",
    "release_date": "2025-04-30",
    "vote_average": 7.365,
    "vote_count": 2599
  },
  {
    "id": 1163545,
    "title": "Lubuk",
    "genres": [
      "Thriller"
    ],
    "overview": "30 years ago, Titi and Dirwan appeared at a small town and took over a rundown mansion where they turned it into a quaint and idyllic home for the homeless and those who have nowhere to go. It has created a buzz among the small community and nearby towns especially when Dirwan has never demanded for any payments and he has taken great efforts and measures to provide the best care and facilities for the residents. Unknown to everyone, the shelter home is only the front for another ludicrous but dark and sinister business. Business that Titi and Dirwan have been profiting for close to 2 decades. Its charming facade and warm hospitality lure unsuspecting victims. This place is perfect as it is located at the edge of the town, far away from anyone and coupled with unreliable internet and mobile phone services.",
    "release_date": "2024-07-18",
    "vote_average": 0.0,
    "vote_count": 0
  },
  {
    "id": 1185528,
    "title": "Legends of the Condor Heroes: The Gallants",
    "genres": [
      "Action",
      "Drama",
      "History"
    ],
    "overview": "Under Genghis Khan, the Mongolian army pushes west to destroy the Jin Dynasty, setting its sights on the Song Dynasty next. Amid internal conflicts among martial arts schools, Guo Jing unites the Central Plains' warriors to defend Xiangyang, embodying courage and loyalty in the fight for the nation.",
    "release_date": "2025-01-29",
    "vote_average": 6.8,
    "vote_count": 63
  }
]